In [1]:
import pandas as pd
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [2]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [5]:
df.set_index('month',)

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [4]:
df_index = df.set_index('month')

In [19]:
df_combined = (df,df_index)

In [20]:
df_combined

(   month  year  sale
 0      1  2012    55
 1      4  2014    40
 2      7  2013    84
 3     10  2014    31,        year  sale
 month
 1      2012    55
 4      2014    40
 7      2013    84
 10     2014    31)